Reports/КонтрольВводаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>КонтрольВводаДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресХранилищаТЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ВКД_ОприходованиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВКД_ОприходованиеНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦенаСоСкидкой</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДокументыКПроведению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДокументыКПроведению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зарегистрировано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыИнвойса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыИнвойса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПрибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидДвиженияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидДвиженияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвестиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Биржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логистика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Перемещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Перемещение</Name>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВКД_ДополнительныеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВКД_ДополнительныеЗатраты</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/КонтрольВводаДанных/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// 1. Получаем текст макета
	ИмяМакета = "ОсновнаяСхемаКомпоновкиДанных";
	СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
	Настройки = КомпоновщикНастроек.Настройки;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// 2. Создаем таблицу для СКД
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Объект", 		ТипСсылка());
	ТаблицаДанных.Колонки.Добавить("Задача", 		Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("Приоритет", 	Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Тэг", 			Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("НомерИндикатора", Новый ОписаниеТипов("Число"));
	
	ЗаполнитьТаблицуДанных(ТаблицаДанных);
	
	ЭтотОбъект.АдресХранилищаТЗ = ПоместитьВоВременноеХранилище(ТаблицаДанных, Новый УникальныйИдентификатор);

    // 3. Передаем таблицу в СКД
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ТипСсылка()
	
	// 1. Создаем пустой массив для хранения разрешенных типов
	МассивТипов = Новый Массив;
	
	// 2. Добавляем в массив нужные типы
	// Обязательно указываем конкретные виды документов и справочников
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка._ВозвратОтПокупателя"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ДвижениеДенег"));
	МассивТипов.Добавить(Тип("ДокументСсылка.Перемещение"));
	МассивТипов.Добавить(Тип("ДокументСсылка._Инвойс"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтправкаПеремещений"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ВКД_ДополнительныеЗатраты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	// 3. Создаем объект "ОписаниеТипов" на основе собранного массива
	Возврат Новый ОписаниеТипов(МассивТипов);	
	
КонецФункции // ()

Процедура ЗаполнитьТаблицуДанных(тз)
                                  
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)));
	Запр.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)));
	
	// 1.
	
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЧТовары.Ссылка КАК Инвойс,
	             |	ТЧТовары.Номенклатура КАК Номенклатура,
	             |	ТЧТовары.Номенклатура.Вес КАК Вес
	             |ИЗ
	             |	Документ._Инвойс.ВКД_Товары КАК ТЧТовары
	             |ГДЕ
	             |	ТЧТовары.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ПривязкиИнвойсов.Инвойс
	             |			ИЗ
	             |				Документ.ДвижениеДенег.Инвойсы КАК ПривязкиИнвойсов
	             |			ГДЕ
	             |				ПривязкиИнвойсов.Ссылка.Проведен
	             |				И ПривязкиИнвойсов.Ссылка.Дата > ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -3))
	             |	И НЕ ТЧТовары.Ссылка.ПометкаУдаления
	             |	И ТЧТовары.Ссылка.Дата >= &ДатаНачала
	             |	И ТЧТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	             |	И ТЧТовары.Номенклатура.Вес < 9
	             |	И НЕ ТЧТовары.Номенклатура В
	             |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |					ТоварыЛокал.Номенклатура
	             |				ИЗ
	             |					Документ._Инвойс.ВКД_Товары КАК ТоварыЛокал
	             |				ГДЕ
	             |					ТоварыЛокал.Ссылка.Локал
	             |					И ТоварыЛокал.Ссылка.Проведен)";
	Запр.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Номенклатура"), "Заполнить вес номенклатуры", 1, "Номенклатура без веса", 1);
	ДобавитьСтрокиТаблицы(тз,  Выгрузка.ВыгрузитьКолонку("Инвойс"), "Перепровести инвойсы с товарами без веса", 2, "Инвойсы без веса", 2);

	// 2.  
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ПриходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	             |ГДЕ
	             |	ПриходнаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И НЕ ПриходнаяНакладная.Окончательно
	             |	И ПриходнаяНакладная.Проведен
	             |	И ПриходнаяНакладная.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ТЧТовары.Ссылка
	             |			ИЗ
	             |				Документ.ПриходнаяНакладная.Товары КАК ТЧТовары)";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Установить <Окончательно>", 2, "Приходные не Ок", 3);
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	РасходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	             |ГДЕ
	             |	РасходнаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И НЕ РасходнаяНакладная.Окончательно
	             |	И РасходнаяНакладная.Проведен
	             |	И РасходнаяНакладная.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ТЧТовары.Ссылка
	             |			ИЗ
	             |				Документ.РасходнаяНакладная.Товары КАК ТЧТовары)";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Установить <Окончательно>", 3, "Расходные не Ок", 4);
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	Перемещение.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.Перемещение КАК Перемещение
	             |ГДЕ
	             |	Перемещение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И НЕ Перемещение.Окончательно
	             |	И Перемещение.Проведен
	             |	И Перемещение.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ТЧТовары.Ссылка
	             |			ИЗ
	             |				Документ.Перемещение.Товары КАК ТЧТовары)";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Установить <Окончательно>", 3, "Перемещения не Ок", 3);

	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ДвижениеДенег.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ДвижениеДенег КАК ДвижениеДенег
	             |ГДЕ
	             |	ДвижениеДенег.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И НЕ ДвижениеДенег.Окончательно
	             |	И ДвижениеДенег.Проведен";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Установить <Окончательно>", 3, "Движения денег не Ок", 5);

	// 3.
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ПриходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	             |ГДЕ
	             |	ПриходнаяНакладная.ВКД_Инвойс <> ЗНАЧЕНИЕ(Документ._Инвойс.ПустаяСсылка)
	             |	И ПриходнаяНакладная.Дата < ПриходнаяНакладная.ВКД_Инвойс.Дата
	             |	И ПриходнаяНакладная.Проведен
	             |	И ПриходнаяНакладная.Дата >= &ДатаНачала
	             |	И ПриходнаяНакладная.ВКД_Инвойс.Проведен";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Изменить дату накладной (дата раньше даты инвойса)", 5, "Даты прих.накладных", 3);
	
	//4.
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ОприходНоменклатуры.Документ КАК Документ,
	             |	ОприходНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ОприходНоменклатуры.КоличествоОстаток КАК Количество,
	             |	ОприходНоменклатуры.СуммаЗакупкиОстаток КАК Сумма
	             |ИЗ
	             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Остатки КАК ОприходНоменклатуры
	             |ГДЕ
	             |	ОприходНоменклатуры.Документ.Дата >= &ДатаНачала
	             |	И ОприходНоменклатуры.Документ В
	             |			(ВЫБРАТЬ
	             |				СостоянияИнвойсов.Инвойс
	             |			ИЗ
	             |				РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |			ГДЕ
	             |				СостоянияИнвойсов.Инвойс.Дата >= &ДатаНачала
	             |				И СостоянияИнвойсов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнвойса.Прибыл))"; 
	 Выборка = Запр.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
	 	ДобавитьСтрокуТаблицы(тз, Выборка.Документ, СтрШаблон("Разница инвойс-накладные '%1': кол-во %2, сумма %3", 
																Выборка.Номенклатура, 
																Выборка.Количество, 
																Формат(Выборка.Сумма,"ЧДЦ=2")), 
																7, 
																"Прибывшие ивойсы",
																2);
	 КонецЦикла;
	 
	 // 5.1.  
	 
	 Запр.УстановитьПараметр("Дата", ОбщегоНазначенияПовтИсп.ПредустановленнаяДатаУчета("НачалоИспользованияПривязокИнвойсов"));
	 Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	              |	ДвижениеДенегИнвойсы.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
	              |ГДЕ
	              |	ДвижениеДенегИнвойсы.Инвойс = ЗНАЧЕНИЕ(Документ._Инвойс.ПустаяСсылка)
	              |	И ДвижениеДенегИнвойсы.Ссылка.ВидДвиженияДенег = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияДенег.Поставщики)
	              |	И ДвижениеДенегИнвойсы.Ссылка.Проведен
	              |	И ДвижениеДенегИнвойсы.Ссылка.Дата >= &Дата";
	 Выгрузка = Запр.Выполнить().Выгрузить();
	 ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "В привязках не указан ивойс", 5, "Привязки инвойсов", 5);
	 
	 // 5.2.
	 
	 Запр.УстановитьПараметр("Дата", ОбщегоНазначенияПовтИсп.ПредустановленнаяДатаУчета("НачалоИспользованияПривязокИнвойсов"));
	 Запр.Текст = "ВЫБРАТЬ
	              |	ДвижениеДенег.Ссылка КАК Ссылка,
	              |	ДвижениеДенег.Валюта КАК Валюта,
	              |	ВЫБОР
	              |		КОГДА ТЧ_Инвойсы.Ссылка ЕСТЬ NULL
	              |			ТОГДА ""Нет привязанных инвойсов %1""
	              |		ИНАЧЕ ""Сумма оплаты %1 не привязана к инвойсам""
	              |	КОНЕЦ КАК Задача
	              |ИЗ
	              |	Документ.ДвижениеДенег КАК ДвижениеДенег
	              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |			Инвойсы.Ссылка КАК Ссылка
	              |		ИЗ
	              |			Документ.ДвижениеДенег.Инвойсы КАК Инвойсы) КАК ТЧ_Инвойсы
	              |		ПО ДвижениеДенег.Ссылка = ТЧ_Инвойсы.Ссылка
	              |ГДЕ
	              |	ДвижениеДенег.Проведен
	              |	И ДвижениеДенег.Дата >= &ДатаНачала
	              |	И ДвижениеДенег.Дата >= &Дата
	              |	И ДвижениеДенег.ВидДвиженияДенег = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияДенег.Поставщики)
	              |	И ДвижениеДенег.Контрагент.ПривязыватьИнвойсы
	              |	И ДвижениеДенег.Сумма > ДвижениеДенег.СуммаПривязаноИнвойсов";
	 Выборка = Запр.Выполнить().Выбрать();  
	 Пока Выборка.Следующий() Цикл
	 	ДобавитьСтрокуТаблицы(тз, Выборка.Ссылка, СтрШаблон(Выборка.Задача, Выборка.Валюта), 5, "Привязки инвойсов", 5);
	 КонецЦикла;
 
	 // 6.
	 
	 Если ПравоДоступа("Чтение", Метаданные.Документы.ПриходнаяНакладная) И ПравоДоступа("Чтение", Метаданные.Документы.ВКД_ДополнительныеЗатраты) Тогда
		 
		 Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ  
		 			  // Шаг 1. Собираем все заявленные связи со стороны "ДопЗатрат"
		              |	ТЧ_Документы.Ссылка КАК ДопЗатраты,
		              |	ТЧ_Документы.Документ КАК ПриходнаяНакладная,
		              |	ТЧ_Документы.Документ.Проведен КАК ПН_Проведена
		              |ПОМЕСТИТЬ ВТ_ИзДопЗатрат
		              |ИЗ
		              |	Документ.ВКД_ДополнительныеЗатраты.Документы КАК ТЧ_Документы
		              |ГДЕ
		              |	ТЧ_Документы.Ссылка.Дата >= &ДатаНачала
		              |	И ТЧ_Документы.Ссылка.ПометкаУдаления = ЛОЖЬ
		              |	И ТЧ_Документы.Документ <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
		              |;
		              |  
					  // Шаг 2. Собираем все заявленные связи со стороны "Приходных накладных"
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	ТЧ_Затраты.ДокументЗатрат КАК ДопЗатраты,
		              |	ТЧ_Затраты.Ссылка КАК ПриходнаяНакладная,
		              |	ТЧ_Затраты.ДокументЗатрат.Проведен КАК ДопЗатраты_Проведены
		              |ПОМЕСТИТЬ ВТ_ИзПриходных
		              |ИЗ
		              |	Документ.ПриходнаяНакладная.Затраты КАК ТЧ_Затраты
		              |ГДЕ
		              |	ТЧ_Затраты.Ссылка.Дата >= &ДатаНачала
		              |	И ТЧ_Затраты.Ссылка.ПометкаУдаления = ЛОЖЬ
		              |	И ТЧ_Затраты.ДокументЗатрат <> ЗНАЧЕНИЕ(Документ.ВКД_ДополнительныеЗатраты.ПустаяСсылка)
		              |;
		              |
					  |////////////////////////////////////////////////////////////////////////////////
					  // Шаг 3. Собираем итоговые данные по 4 условиям ТЗ
					  // Пункт 1: Непроведенные ПриходныеНакладные в ДопЗатратах
					  |ВЫБРАТЬ
					  | 1 КАК КодОшибки,
					  |	""Непроведенная ПрихНакладная указана в ДопЗатратах"" КАК ОписаниеПроблемы,
		              |	ВТ_ИзДопЗатрат.ПриходнаяНакладная КАК ПриходнаяНакладная,
		              |	ВТ_ИзДопЗатрат.ДопЗатраты КАК ДопЗатраты
		              |ИЗ
		              |	ВТ_ИзДопЗатрат КАК ВТ_ИзДопЗатрат
		              |ГДЕ
		              |	ВТ_ИзДопЗатрат.ПН_Проведена = ЛОЖЬ
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
					  // Пункт 2: Непроведенные ДопЗатраты в ПриходныхНакладных
					  |
		              |ВЫБРАТЬ
					  | 2,
		              |	""Непроведенные ДопЗатраты указаны в ПрихНакладной"",
		              |	ВТ_ИзПриходных.ПриходнаяНакладная,
		              |	ВТ_ИзПриходных.ДопЗатраты
		              |ИЗ
		              |	ВТ_ИзПриходных КАК ВТ_ИзПриходных
		              |ГДЕ
		              |	ВТ_ИзПриходных.ДопЗатраты_Проведены = ЛОЖЬ
		              |
		              |ОБЪЕДИНИТЬ ВСЕ 
					  // Пункт 3: ПН есть в ДопЗатратах, но в самой ПН нет этих ДопЗатрат (Односторонняя связь)
		              |
		              |ВЫБРАТЬ 
					  | 3,
		              |	""ПрихНакладная есть в док-те ДопЗатраты, но сам док-т ДопЗатрат не указан в ПрихНакладной"",
		              |	ВТ_ИзДопЗатрат.ПриходнаяНакладная,
		              |	ВТ_ИзДопЗатрат.ДопЗатраты
		              |ИЗ
		              |	ВТ_ИзДопЗатрат КАК ВТ_ИзДопЗатрат
		              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзПриходных КАК ВТ_ИзПриходных
		              |		ПО ВТ_ИзДопЗатрат.ДопЗатраты = ВТ_ИзПриходных.ДопЗатраты
		              |			И ВТ_ИзДопЗатрат.ПриходнаяНакладная = ВТ_ИзПриходных.ПриходнаяНакладная
		              |ГДЕ
		              |	ВТ_ИзПриходных.ДопЗатраты ЕСТЬ NULL
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
					  // Пункт 4: ДопЗатраты есть в ПН, но в самих ДопЗатратах нет этой ПН (Односторонняя связь)
		              |
		              |ВЫБРАТЬ 
					  | 4,
		              |	""ДопЗатраты есть в ПрихНакладной, но сама ПрихНакладная не указана в ДопЗатратах"",
		              |	ВТ_ИзПриходных.ПриходнаяНакладная,
		              |	ВТ_ИзПриходных.ДопЗатраты
		              |ИЗ
		              |	ВТ_ИзПриходных КАК ВТ_ИзПриходных
		              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзДопЗатрат КАК ВТ_ИзДопЗатрат
		              |		ПО ВТ_ИзПриходных.ДопЗатраты = ВТ_ИзДопЗатрат.ДопЗатраты
		              |			И ВТ_ИзПриходных.ПриходнаяНакладная = ВТ_ИзДопЗатрат.ПриходнаяНакладная
		              |ГДЕ
		              |	ВТ_ИзДопЗатрат.ДопЗатраты ЕСТЬ NULL
		              |
		              |УПОРЯДОЧИТЬ ПО
		              |	ОписаниеПроблемы,
		              |	ПриходнаяНакладная,
		              |	ДопЗатраты";
		 Выборка = Запр.Выполнить().Выбрать();
		 Пока Выборка.Следующий() Цикл   
			 Если Выборка.КодОшибки = 1 Тогда
			 	ОбъектСсылка = Выборка.ДопЗатраты;
			 	Задача = Выборка.ОписаниеПроблемы + ": " + Выборка.ПриходнаяНакладная;
			 ИначеЕсли Выборка.КодОшибки = 2 Тогда
			 	ОбъектСсылка = Выборка.ПриходнаяНакладная;
			 	Задача = Выборка.ОписаниеПроблемы + ": " + Выборка.ДопЗатраты;
			 ИначеЕсли Выборка.КодОшибки = 3 Тогда
			 	ОбъектСсылка = Выборка.ДопЗатраты;
			 	Задача = Выборка.ОписаниеПроблемы + ": " + Выборка.ПриходнаяНакладная;
             Иначе
			 	ОбъектСсылка = Выборка.ПриходнаяНакладная;
			 	Задача = Выборка.ОписаниеПроблемы + ": " + Выборка.ДопЗатраты;
			 КонецЕсли;
	    	 ДобавитьСтрокуТаблицы(тз, ОбъектСсылка, Задача, 9, "Доп.затраты", 3);
		 КонецЦикла;
		 
	 КонецЕсли; 
	 
	 // 7.1
	 
	 Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	              |	Отправка.Ссылка КАК Ссылка,
	              |	ДокументыСНулевымВесом.ТоварныйДокумент КАК ПроблемныйДокумент,
	              |	ДокументыСНулевымВесом.Номенклатура КАК ПроблемнаяНоменклатура
	              |ИЗ
	              |	Документ.ОтправкаПеремещений КАК Отправка
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ОтправкаТЧ
	              |		ПО Отправка.Ссылка = ОтправкаТЧ.Ссылка
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	              |			ПеремещениеТовары.Ссылка КАК ТоварныйДокумент,
	              |			ПеремещениеТовары.Номенклатура КАК Номенклатура
	              |		ИЗ
	              |			Документ.Перемещение.Товары КАК ПеремещениеТовары
	              |		ГДЕ
	              |			ПеремещениеТовары.Номенклатура.Вес = 0
	              |		
	              |		ОБЪЕДИНИТЬ ВСЕ
	              |		
	              |		ВЫБРАТЬ
	              |			РасходнаяТовары.Ссылка,
	              |			РасходнаяТовары.Номенклатура
	              |		ИЗ
	              |			Документ.РасходнаяНакладная.Товары КАК РасходнаяТовары
	              |		ГДЕ
	              |			РасходнаяТовары.Номенклатура.Вес = 0) КАК ДокументыСНулевымВесом
	              |		ПО (ОтправкаТЧ.ТоварныйДокумент = ДокументыСНулевымВесом.ТоварныйДокумент)
	              |ГДЕ
	              |	Отправка.Проведен
	              |	И Отправка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	              |	И ДокументыСНулевымВесом.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)";
	 Выборка = Запр.Выполнить().Выбрать();  
	 Пока Выборка.Следующий() Цикл
			ДобавитьСтрокуТаблицы(тз, Выборка.Ссылка, 
									СтрШаблон("Нулевой вес номенклатуры в документе %1, входящем в перемещение: %2", 
										Выборка.ПроблемныйДокумент,
										Выборка.ПроблемнаяНоменклатура),
									5, 
									"Отправки перемещений",
									3);
	 КонецЦикла;
	 //ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Нулевой вес номенклатуры в документах, входящих в перемещение", 5, "Отправки перемещений", 3);
	 
	 // 7.2 
	 // закомментировано, т.к. не должно соблюдаться равенство
	 
	 //Запр.Текст = "ВЫБРАТЬ
	 //             |	Отправка.Ссылка КАК Ссылка,
	 //             |	Отправка.Количество КАК КоличествоВШапке,
	 //             |	Отправка.Сумма КАК СуммаВШапке,
	 //             |	ЕСТЬNULL(ИтогиТЧ.КоличествоПоТЧ, 0) КАК КоличествоИзВложенныхДок,
	 //             |	ЕСТЬNULL(ИтогиТЧ.СуммаПоТЧ, 0) КАК СуммаИзВложенныхДок
	 //             |ИЗ
	 //             |	Документ.ОтправкаПеремещений КАК Отправка
	 //             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	 //             |			ТЧ.Ссылка КАК ОтправкаСсылка,
	 //             |			СУММА(ЕСТЬNULL(ВложенныеДокументы.Количество, 0)) КАК КоличествоПоТЧ,
	 //             |			СУММА(ЕСТЬNULL(ВложенныеДокументы.Сумма, 0)) КАК СуммаПоТЧ
	 //             |		ИЗ
	 //             |			Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
	 //             |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	 //             |					ПеремещениеТовары.Ссылка КАК ТоварныйДокумент,
	 //             |					СУММА(ПеремещениеТовары.Количество) КАК Количество,
	 //             |					СУММА(ПеремещениеТовары.СуммаЗакупки) КАК Сумма
	 //             |				ИЗ
	 //             |					Документ.Перемещение.Товары КАК ПеремещениеТовары
	 //             |				
	 //             |				СГРУППИРОВАТЬ ПО
	 //             |					ПеремещениеТовары.Ссылка
	 //             |				
	 //             |				ОБЪЕДИНИТЬ ВСЕ
	 //             |				
	 //             |				ВЫБРАТЬ
	 //             |					РасходнаяТовары.Ссылка,
	 //             |					СУММА(РасходнаяТовары.Количество),
	 //             |					СУММА(РасходнаяТовары.СуммаЗакупки)
	 //             |				ИЗ
	 //             |					Документ.РасходнаяНакладная.Товары КАК РасходнаяТовары
	 //             |				
	 //             |				СГРУППИРОВАТЬ ПО
	 //             |					РасходнаяТовары.Ссылка) КАК ВложенныеДокументы
	 //             |				ПО ТЧ.ТоварныйДокумент = ВложенныеДокументы.ТоварныйДокумент
	 //             |		ГДЕ
	 //             |			ТЧ.Ссылка.Проведен
	 //             |			И ТЧ.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	 //             |		
	 //             |		СГРУППИРОВАТЬ ПО
	 //             |			ТЧ.Ссылка) КАК ИтогиТЧ
	 //             |		ПО Отправка.Ссылка = ИтогиТЧ.ОтправкаСсылка
	 //             |ГДЕ
	 //             |	Отправка.Проведен
	 //             |	И Отправка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	 //             |	И (Отправка.Количество <> ЕСТЬNULL(ИтогиТЧ.КоличествоПоТЧ, 0)
	 //             |			ИЛИ Отправка.Сумма <> ЕСТЬNULL(ИтогиТЧ.СуммаПоТЧ, 0))";
	 //Выгрузка = Запр.Выполнить().Выгрузить();
	 //ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Не совпадают количество отправки и количество по вложенным документам", 5, "Отправки перемещений", 3);
		
	// 8.
	
	Если ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ВКД_ОприходованиеНоменклатуры) Тогда
		
		Запр.Текст = "// Шаг 0. Ищем целевые инвойсы.
				|// Получаем список Инвойсов, на основании к-рых есть хотя бы одна проведенная Прих.накладная с датой позже &ДатаНачала
				|ВЫБРАТЬ РАЗЛИЧНЫЕ 
				|	ПН.ВКД_Инвойс КАК Инвойс
				|ПОМЕСТИТЬ ВТ_ЦелевыеИнвойсы
				|ИЗ
				|	Документ.ПриходнаяНакладная КАК ПН
				|ГДЕ
				|	ПН.Дата >= &ДатаНачала
				|	И ПН.Проведен // Обязательное условие, чтобы не учитывать черновики
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|// Шаг 1. Собираем статистику по поставкам.
				|// Используем внутреннее соединение с целевыми инвойсами (Шаг 0).
				|ВЫБРАТЬ
				|	Обороты.Документ КАК Инвойс,
				|	Обороты.Поставка КАК Поставка,
				|	МАКСИМУМ(ВЫБОР КОГДА Обороты.КоличествоПриход > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ЗаявленоВИнвойсе,
				|	МАКСИМУМ(ВЫБОР КОГДА Обороты.КоличествоРасход > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ЕстьВНакладной
				|ПОМЕСТИТЬ ВТ_СтатусыПоставок
				|ИЗ
				|	ВТ_ЦелевыеИнвойсы КАК ЦелевыеИнвойсы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Обороты КАК Обороты
				|		ПО ЦелевыеИнвойсы.Инвойс = Обороты.Документ
				|		
				|СГРУППИРОВАТЬ ПО
				|	Обороты.Документ,
				|	Обороты.Поставка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|// Шаг 2. Отбираем только те Инвойсы, где ВСЕ заявленные поставки имеют накладные (Пункт 1).
				|ВЫБРАТЬ
				|	ВТ_СтатусыПоставок.Инвойс КАК Инвойс
				|ПОМЕСТИТЬ ВТ_ИнвойсыСПолнымНаборомНакладных
				|ИЗ
				|	ВТ_СтатусыПоставок КАК ВТ_СтатусыПоставок
				|СГРУППИРОВАТЬ ПО
				|	ВТ_СтатусыПоставок.Инвойс
				|ИМЕЮЩИЕ
				|	// Исключаем инвойсы, в которых есть поставка, заявленная в инвойсе (1), но по к-рой нет ни одной накладной (0).
				|	МАКСИМУМ(ВЫБОР КОГДА ВТ_СтатусыПоставок.ЗаявленоВИнвойсе = 1 И ВТ_СтатусыПоставок.ЕстьВНакладной = 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) = 0
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|// Шаг 3. Сворачиваем обороты по Номенклатуре и Поставке.
				|// Также соединяем только с нужными инвойсами, чтобы не тянуть из базы лишние данные.
				|ВЫБРАТЬ
				|	Обороты.Документ КАК Инвойс,
				|	Обороты.Поставка КАК Поставка,
				|	Обороты.Номенклатура КАК Номенклатура,
				|	СУММА(Обороты.КоличествоПриход) КАК КоличествоИнвойс,
				|	СУММА(Обороты.КоличествоРасход) КАК КоличествоНакладная
				|ПОМЕСТИТЬ ВТ_ОборотыНоменклатуры
				|ИЗ
				|	ВТ_ЦелевыеИнвойсы КАК ЦелевыеИнвойсы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Обороты КАК Обороты
				|		ПО ЦелевыеИнвойсы.Инвойс = Обороты.Документ
				|СГРУППИРОВАТЬ ПО
				|	Обороты.Документ,
				|	Обороты.Поставка,
				|	Обороты.Номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|// Шаг 4. Итоговая выборка с применением логических условий.
				|ВЫБРАТЬ
				|	ВТ_ОборотыНоменклатуры.Инвойс КАК Инвойс,
				|	ВТ_ОборотыНоменклатуры.Поставка КАК Поставка, 
				|	ВТ_ОборотыНоменклатуры.Номенклатура КАК Номенклатура,
				|	// Выводим разницу: положительное число - излишек (в накладной больше), отрицательное - недостача.
				|	ВТ_ОборотыНоменклатуры.КоличествоНакладная - ВТ_ОборотыНоменклатуры.КоличествоИнвойс КАК Количество
				|ИЗ
				|	ВТ_ОборотыНоменклатуры КАК ВТ_ОборотыНоменклатуры
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвойсыСПолнымНаборомНакладных КАК ВТ_ПолныеИнвойсы
				|		ПО ВТ_ОборотыНоменклатуры.Инвойс = ВТ_ПолныеИнвойсы.Инвойс
				|ГДЕ
				|	(
				|		// Пункт 3: Выводим излишки (в инвойсе 0, а в накладной > 0).
				|		// Работает ВСЕГДА, вне зависимости от того, все ли поставки приехали.
				|		ВТ_ОборотыНоменклатуры.КоличествоИнвойс = 0 
				|		И ВТ_ОборотыНоменклатуры.КоличествоНакладная > 0
				|	)
				|	ИЛИ
				|	(
				|		// Пункты 1 и 2: Инвойс прошел проверку на полноту поставок И есть расхождения в количестве.
				|		ВТ_ПолныеИнвойсы.Инвойс ЕСТЬ НЕ NULL
				|		И ВТ_ОборотыНоменклатуры.КоличествоИнвойс <> ВТ_ОборотыНоменклатуры.КоличествоНакладная
				|	)";
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДобавитьСтрокуТаблицы(тз, Выборка.Инвойс, 
									СтрШаблон("Разница между инвойсом и приходом %1%2: %3 шт.", 
										Выборка.Номенклатура,
										?(Выборка.ПОставка=0,""," (поставка "+Выборка.Поставка+")"),
										Выборка.Количество),
									8, 
									"Пересорт инвойс-приход",
									2);
		КонецЦикла;
	
	КонецЕсли;
		
	// 10. Товары не распределенные в отправки в инвойсах
	
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Поставки.Ссылка КАК Инвойс
	             |ПОМЕСТИТЬ ВТ_ЦелевыеИнвойсы
	             |ИЗ
	             |	Документ._Инвойс.Поставки КАК Поставки
	             |ГДЕ
	             |	Поставки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И Поставки.Ссылка.ПометкаУдаления = ЛОЖЬ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВКД_Товары.Ссылка КАК Инвойс,
	             |	ВКД_Товары.ИДСтроки КАК ИДСтроки,
	             |	ВКД_Товары.Номенклатура КАК Номенклатура,
	             |	СУММА(ВКД_Товары.Количество) КАК Количество
	             |ПОМЕСТИТЬ ВТ_Товары
	             |ИЗ
	             |	Документ._Инвойс.ВКД_Товары КАК ВКД_Товары
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦелевыеИнвойсы КАК ЦелевыеИнвойсы
	             |		ПО ВКД_Товары.Ссылка = ЦелевыеИнвойсы.Инвойс
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВКД_Товары.Ссылка,
	             |	ВКД_Товары.ИДСтроки,
	             |	ВКД_Товары.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Поставки.Ссылка КАК Инвойс,
	             |	Поставки.ИдСтроки КАК ИДСтроки,
	             |	Поставки.Номенклатура КАК Номенклатура,
	             |	СУММА(Поставки.Количество) КАК Количество
	             |ПОМЕСТИТЬ ВТ_Поставки
	             |ИЗ
	             |	Документ._Инвойс.Поставки КАК Поставки
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦелевыеИнвойсы КАК ЦелевыеИнвойсы
	             |		ПО Поставки.Ссылка = ЦелевыеИнвойсы.Инвойс
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Поставки.Ссылка,
	             |	Поставки.ИдСтроки,
	             |	Поставки.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЕСТЬNULL(ВТ_Товары.Инвойс, ВТ_Поставки.Инвойс) КАК Инвойс,
	             |	ЕСТЬNULL(ВТ_Товары.ИДСтроки, ВТ_Поставки.ИДСтроки) КАК ИДСтроки,
	             |	ЕСТЬNULL(ВТ_Товары.Номенклатура, ВТ_Поставки.Номенклатура) КАК Номенклатура,
	             |	ЕСТЬNULL(ВТ_Товары.Количество, 0) КАК КоличествоВТоварах,
	             |	ЕСТЬNULL(ВТ_Поставки.Количество, 0) КАК КоличествоВПоставках,
	             |	ВЫБОР
	             |		КОГДА ВТ_Товары.ИДСтроки ЕСТЬ NULL
	             |			ТОГДА ""Лишняя строка в Поставках (отсутствует ИДСтроки в Товарах)""
	             |		КОГДА ВТ_Поставки.ИДСтроки ЕСТЬ NULL
	             |			ТОГДА ""Товар не распределен (отсутствует ИДСтроки в Поставках)""
	             |		ИНАЧЕ ""Не совпадает распределенное количество""
	             |	КОНЕЦ КАК ОписаниеОшибки
	             |ИЗ
	             |	ВТ_Товары КАК ВТ_Товары
	             |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Поставки КАК ВТ_Поставки
	             |		ПО ВТ_Товары.Инвойс = ВТ_Поставки.Инвойс
	             |			И ВТ_Товары.ИДСтроки = ВТ_Поставки.ИДСтроки
	             |			И ВТ_Товары.Номенклатура = ВТ_Поставки.Номенклатура
	             |ГДЕ
	             |	ЕСТЬNULL(ВТ_Товары.Количество, 0) <> ЕСТЬNULL(ВТ_Поставки.Количество, 0)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Инвойс,
	             |	ИДСтроки";
	Выборка = Запр.Выполнить().Выбрать();   
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуТаблицы(тз, Выборка.Инвойс, 
								"Неверно распределены товары по отправкам: " + Выборка.ОписаниеОшибки,
								10, 
								"Распределение отправок",
								2);
	КонецЦикла;

	// 11.
	
	//Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//             |	РасходнаяНакладнаяТовары.Ссылка КАК Документ
	//			 //|	РасходнаяНакладнаяТовары.стрПроцент КАК Процент
	//             |ИЗ
	//             |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	//             |ГДЕ
	//             |	РасходнаяНакладнаяТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//             |	И РасходнаяНакладнаяТовары.Ссылка.Проведен
	//             |	И ДЛИНАСТРОКИ(СТРЗАМЕНИТЬ(РасходнаяНакладнаяТовары.стрПроцент, ""-"", """")) > 3";
	//Выгрузка = Запр.Выполнить().Выгрузить();
	//ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Документ"), "Неадекватная наценка", 11, "Неадекватная наценка", 4);
	////Выборка = Запр.Выполнить().Выбрать();   
	////Пока Выборка.Следующий() Цикл
	////	ДобавитьСтрокуТаблицы(тз, Выборка.Документ, 
	////							СтрШаблон("Неадекватная наценка (%1)", Выборка.Процент),
	////							11, 
	////							"Неадекватная наценка",
	////							4);
	////КонецЦикла;
		
	Запр.УстановитьПараметр("ГраницаНаценкиПроцент", 200);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	РНТовары.Ссылка КАК Документ
	             |ИЗ
	             |	Документ.РасходнаяНакладная.Товары КАК РНТовары
	             |ГДЕ
	             |	РНТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И РНТовары.Ссылка.Проведен
	             |	И РНТовары.ВКД_ЦенаСЗатратами * РНТовары.Количество <> 0
	             |	И (РНТовары.СуммаПродажи - РНТовары.ВКД_ЦенаСЗатратами * РНТовары.Количество) * 100 / (РНТовары.ВКД_ЦенаСЗатратами * РНТовары.Количество) >= &ГраницаНаценкиПроцент";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Документ"), "Неадекватная наценка (>200%)", 11, "Неадекватная наценка", 4);

	// 12.
	
 	Запр.Текст = "ВЫБРАТЬ
              |	ВозвратОтПокупателя.Ссылка КАК ДокВозврата,
              |	ВозвратОтПокупателя.РасходняНакладная КАК ДокПродажи,
              |	ВозвратОтПокупателя.НомерСтроки КАК НомерСтроки,
              |	ВозвратОтПокупателя.Серия КАК Серия,
              |	ВозвратОтПокупателя.Партия КАК Партия,
              |	ВозвратОтПокупателя.ЦенаПродажи КАК ЦенаВозврата,
              |	РасходнаяНакладная.СуммаПродажи КАК ЦенаПродажи
              |ИЗ
              |	Документ._ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателя
              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладная
              |		ПО ВозвратОтПокупателя.РасходняНакладная = РасходнаяНакладная.Ссылка
              |			И ВозвратОтПокупателя.Партия = РасходнаяНакладная.Партия
              |ГДЕ
              |	ВозвратОтПокупателя.Ссылка.Проведен
              |	И ВозвратОтПокупателя.Ссылка.Дата >= &ДатаНачала
              |	И ВозвратОтПокупателя.ЦенаПродажи <> РасходнаяНакладная.СуммаПродажи";
	Выборка = Запр.Выполнить().Выбрать();   
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуТаблицы(тз, Выборка.ДокВозврата, 
								СтрШаблон("Цена возврата (%1) отличается от цены продажи (%2): строка %3",
											Формат(Выборка.ЦенаВозврата, "ЧДЦ=2"), Формат(выборка.ЦенаПродажи, "ЧДЦ=2"), Выборка.НомерСтроки),
								12, 
								"Цены возвратов",
								4);
	КонецЦикла;	
		
	// 13.
	
	Запр.УстановитьПараметр("ВалютаДоллар", ПараметрыСеанса.БазоваяВалюта);
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЧ_Инвойсы.Ссылка КАК Документ
	             |ИЗ
	             |	Документ.ДвижениеДенег.Инвойсы КАК ТЧ_Инвойсы
	             |ГДЕ
	             |	ТЧ_Инвойсы.Ссылка.Проведен
	             |	И ТЧ_Инвойсы.Ссылка.ВидДвиженияДенег = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияДенег.Поставщики)
	             |	И ТЧ_Инвойсы.Ссылка.СубДВалюта <> &ВалютаДоллар
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ТЧ_Инвойсы.Ссылка
	             |
	             |ИМЕЮЩИЕ
	             |	СУММА(ВЫБОР
	             |			КОГДА ТЧ_Инвойсы.Инвойс.ДокументОснование.Валюта = ТЧ_Инвойсы.Ссылка.Валюта
	             |				ТОГДА 1
	             |			КОГДА ТЧ_Инвойсы.Инвойс.ДокументОснование.Валюта = ТЧ_Инвойсы.Ссылка.СубДВалюта
	             |				ТОГДА 1
	             |			ИНАЧЕ 0
	             |		КОНЕЦ) = 0";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Документ"), "Неверная валюта оплаты инвойса", 13, "Неверная валюта", 5);
	
		
	// 14.
	Запр.УстановитьПараметр("СтрокаПоиска", "Поставщик%");
	Запр.Текст = "ВЫБРАТЬ
	             |	Контрагенты.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Контрагенты КАК Контрагенты
	             |ГДЕ
	             |	Контрагенты.Ссылка В ИЕРАРХИИ
	             |			(ВЫБРАТЬ
	             |				Контрагенты.Ссылка КАК Ссылка
	             |			ИЗ
	             |				Справочник.Контрагенты КАК Контрагенты
	             |			ГДЕ
	             |				Контрагенты.Наименование ПОДОБНО &СтрокаПоиска
	             |				И НЕ Контрагенты.ПометкаУдаления
	             |				И Контрагенты.ЭтоГруппа)
	             |	И Контрагенты.Псевдоним = """"
	             |	И НЕ Контрагенты.ПометкаУдаления
	             |	И НЕ Контрагенты.ЭтоГруппа";	
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Не зашифровано имя поставщика", 14, "Незашифров.поставщики", 1);
		
		
		
		
	// 100. 
	
	Запр.УстановитьПараметр("ДатаТекущая", ТекущаяДатаСеанса());
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ДокументыКПроведению.Документ КАК Документ,
	             |	ДокументыКПроведению.Инициатор КАК Инициатор
	             |ИЗ
	             |	РегистрСведений.ДокументыКПроведению КАК ДокументыКПроведению
	             |ГДЕ
	             |	ДокументыКПроведению.Зарегистрировано < ДОБАВИТЬКДАТЕ(&ДатаТекущая, ДЕНЬ, -1)";	
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Документ"), "Не удается автоматически перепровести", 100, "Не проводятся", 1);

		
	// передадим ТЗ в форму
	
    Адрес = ПоместитьВоВременноеХранилище(тз);
    // Записываем адрес в параметр СКД, чтобы форма могла его прочитать
    ПараметрАдрес = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("АдресДанныхДляФормы");
    Если ПараметрАдрес <> Неопределено Тогда
        ПараметрАдрес.Значение = Адрес;
        ПараметрАдрес.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокиТаблицы(тз, МассивОбъектов, Задача, Приоритет, Тэг, НомерИндикатора)
	
	Для каждого Эл Из МассивОбъектов Цикл  
		ДобавитьСтрокуТаблицы(тз, Эл, Задача, Приоритет, Тэг, НомерИндикатора)
	КонецЦикла;

КонецПроцедуры 

Процедура ДобавитьСтрокуТаблицы(тз, Объект, Задача, Приоритет, Тэг, НомерИндикатора)
	
	НайдСтроки = тз.НайтиСтроки(Новый Структура("Объект", Объект));
	Если НайдСтроки.Количество() = 0 Тогда
		СтрокаТЗ = тз.Добавить();
	Иначе	
		СтрокаТЗ = НайдСтроки[0];
		Если Найти(СтрокаТЗ.Задача, Задача) > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	СтрокаТЗ.Объект	= Объект;  
	Если ЗначениеЗаполнено(СтрокаТЗ.Задача) Тогда
		СтрокаТЗ.Задача = СтрокаТЗ.Задача + ";" + Символы.ПС;
	КонецЕсли;
	СтрокаТЗ.Задача	= "" + СтрокаТЗ.Задача + Задача;
	СтрокаТЗ.Приоритет	= Приоритет;
	СтрокаТЗ.Тэг = Тэг;
	СтрокаТЗ.НомерИндикатора = НомерИндикатора; 
	
КонецПроцедуры
